simplementeUnPorito/Tesis-firmware-psoc/AcondicionamientoAnalogico.cydsn/main.c
    filt = dma_buf_to_i24(g_dma_filt_buf);

    if (g_state == PSOC_SAMPLING && g_capture_done == 0u &&
        g_batches_captured < capture_target_batches() &&
        g_batch_fill < BATCH_SAMPLES)
    {
        uint16 pos = (uint16)(g_batch_fill * SAMPLE_BYTES);
        g_capture_raw[g_batches_captured][pos]      = (uint8)( filt        & 0xFFu);
        g_capture_raw[g_batches_captured][pos + 1u] = (uint8)((filt >>  8u) & 0xFFu);
        g_capture_raw[g_batches_captured][pos + 2u] = (uint8)((filt >> 16u) & 0xFFu);
        g_batch_fill++;
        if (g_batch_fill >= BATCH_SAMPLES)
        {
            g_batch_fill = 0u;
            g_batches_captured++;
            if (g_batches_captured >= capture_target_batches()) {
                g_capture_done = 1u;
            }
        }
    }
}

CY_ISR(isr_Timer)
{
    Timer_ReadStatusRegister();
    g_timer_ticks++;
    if (rx_state != 0u) {
        g_rx_watch_ticks++;
        if (g_rx_watch_ticks >= RX_WATCHDOG_TICKS) {
            g_rx_watch_ticks = 0u;
            watchdog_rx = 1u;
        }
    } else {
        g_rx_watch_ticks = 0u;
    }
    Timer_Stop();
    Timer_WritePeriod(TIMEOUT_COUNTS);
    Timer_Start();
}

CY_ISR(isr_SyncIn)
{
    uint8 saved;
#if defined(SYNC_IN_INTSTAT)
    (void)SYNC_IN_ClearInterrupt();
#endif
    if (SYNC_IN_Read())
    {
        uart_send_diag(PSOC_EVT_SYNC_RISE, g_state);
        if (g_state == PSOC_ARMED)
        {
            if (g_stream_mode != 0u) {
                g_fir_discard = FILTER_GROUP_DELAY;  /* compensar retardo grupo FIR */
            }
            psoc_enter_sampling(g_debug_psoc);
        }
    }
    else
    {
        uart_send_diag(PSOC_EVT_SYNC_FALL, g_state);
        ADC_StopConvert();
        timer_start_runtime();
        saved = CyEnterCriticalSection();
        g_batch_fill       = 0u;
        g_batch_ready      = 0u;
        g_batches_sent     = 0u;
        g_batches_captured = 0u;
        g_capture_done     = 0u;
        g_state            = PSOC_IDLE;
        CyExitCriticalSection(saved);
    }
}

CY_ISR(isr_Button_Handler)
{
    isr_Button_ClearPending();
    g_cal_button_pressed = 1u;
}

/* -------------------------------------------------------------------------- */

static void rx_watchdog_start(void) { g_rx_watch_ticks = 0u; watchdog_rx = 0u; }
static void rx_watchdog_stop(void)  { g_rx_watch_ticks = 0u; watchdog_rx = 0u; }

static void led_write(uint8 value)
{
#ifdef CY_PINS_LED_H
    LED_Write(value);
#else
    (void)value;
#endif
}

static void led_toggle(void)
{
#ifdef CY_PINS_LED_H
    if (g_state != PSOC_SAMPLING) {
        LED_Write(LED_Read() ^ 0x01u);
    }
#endif
}

static uint32 timer_now_ticks(void)
{
    uint32 ticks;
    uint8 saved = CyEnterCriticalSection();
    ticks = g_timer_ticks;
    CyExitCriticalSection(saved);
    return ticks;
}

uint32 psoc_now_ticks(void)
{
    return timer_now_ticks();
}

static uint8 ticks_due(uint32 now, uint32 due)
{
    return ((int32)(now - due) >= 0) ? 1u : 0u;
}

/* Selecciona, vía Reg_Select, qué resultado final usan los DMA *_RAM y si cada
 * camino corre en Single (1 muestra/disparo) o Lote (DMA_LOTE_SAMPLES/disparo).
 * La exclusión Single/Lote y raw/Filter la imponen las compuertas del TopDesign;
 * acá solo se escribe el bit pattern que las gobierna (control_0/1/2). */
static void dma_route_select(uint8 use_filter, uint8 raw_lote, uint8 filt_lote)
{
    uint8 reg = 0u;
    if (use_filter) { reg |= 0x02u; }   /* control_1 */
    if (filt_lote)  { reg |= 0x01u; }   /* control_0 */
    if (raw_lote)   { reg |= 0x04u; }   /* control_2 */
    g_raw_route_lote = raw_lote ? 1u : 0u;
    Reg_Select_Write(reg);
}

/* Re-arma DMA_DelSig_RAM_Lote a un estado limpio (offset cero) antes de
 * seleccionarlo. Si el canal se deselecciona a mitad de lote, su cuenta
 * interna (burstcount_remain) queda parcialmente avanzada — CyDmaChSetInitialTd
 * no resetea esa cuenta viva por sí solo (ver CyDmac.c), así que hace falta
 * un ciclo disable → re-set TD inicial → re-enable. Solo debe llamarse
 * mientras el canal está deseleccionado (sin DRQs entrantes). */
static void dma_raw_lote_rearm(void)
{
    CyDmaChDisable(DMA_DelSig_RAM_Lote_DmaHandle);
    CyDmaChSetInitialTd(DMA_DelSig_RAM_Lote_DmaHandle, g_td_raw_lote);
    CyDmaChEnable(DMA_DelSig_RAM_Lote_DmaHandle, 1u);
}

static void PGAgain_Set(uint8 code)
{
    if (code <= 8u) {
        g_pga_code = code;
        psoc_hw_set_pga(code);
    }
}

static void PGAvdac_Set(uint8 code)
{
    if (code <= 8u) {
        g_pgavdac_code = code;
        psoc_hw_set_pgavdac(code);
    }
}

static void psoc_arm(void)
{
    uint8 saved;
    psoc_prepare_capture_path();
    saved = CyEnterCriticalSection();
    capture_reset_locked();
    g_state = PSOC_ARMED;
    CyExitCriticalSection(saved);
    uart_send_diag(PSOC_EVT_ARMED, diag_u16_sat(g_n_batches));
}

static void psoc_start_now(void)
{
    psoc_prepare_capture_path();
    psoc_enter_sampling(0u);
}

static uint8 psoc_start_calibration_if_idle(uint8 send_ack)
{
    if (g_state != PSOC_IDLE) {
        uart_send_diag(PSOC_EVT_CAL_BUSY, g_state);
        if (send_ack) {
            uart_send_cfg_ack(PSOC_CMD_CALIBRATE, 0u);
        }
        return 0u;
    }
    g_batches_sent = 0u;
    g_batches_captured = 0u;
    g_capture_done = 0u;
    psoc_calibration_servo_abort();
    dma_raw_lote_rearm();          /* arranque limpio del canal Lote antes de seleccionarlo */
    dma_route_select(0u, 1u, 0u);  /* fuerza raw+Lote: calibración consume ventanas HW */
    uart_send_diag(PSOC_EVT_CAL_START, 0u);
    if (!psoc_calibration_start_async()) {
        uart_send_diag(PSOC_EVT_CAL_DONE, 0u);
        if (send_ack) {
            uart_send_cfg_ack(PSOC_CMD_CALIBRATE, 0u);
        }
        return 0u;
    }
    g_cal_ack_pending = send_ack ? 1u : 0u;
    g_state = PSOC_CALIBRATING;
    return 1u;
}

static uint8 service_button_calibration(void)
{
    if (!g_cal_button_pressed) {
        return 0u;
    }

    g_cal_button_pressed = 0u;
    uart_send_diag(PSOC_EVT_BUTTON, g_state);
    if (g_state == PSOC_IDLE) {
        (void)psoc_start_calibration_if_idle(0u);
    } else {
        uart_send_diag(PSOC_EVT_BUTTON_IGNORED, g_state);
    }
    return 1u;
}

static void uart_send_capture_batch(uint16 batchIndex)
{
    uint8  frame[FRAME_BYTES];
    uint8 *p;
    uint16 i;
    uint16 pos;
    uint8  crc = 0u;

    frame[0] = 0xABu;
    frame[1] = (uint8)BATCH_SAMPLES;
    frame[2] = (uint8)( g_seq        & 0xFFu);
    frame[3] = (uint8)((g_seq >> 8u) & 0xFFu);

